app/controllers/parts_controller.rb

SELECT "parts".* FROM "parts"
---
  def index
    #@parts = Part.all
    @parts = TableOfPart.all