app/controllers/repairs_controller.rb

SELECT "repairs".* FROM "repairs"
---
  def index
    @repairs = Repair.all