app/controllers/tools_controller.rb

SELECT "tools".* FROM "tools"
---
  def index
    @tools = Tool.all

INSERT INTO "tools" ("cost", "created_at", "in_service", "location", "name", "purchased", "put_in_service", "retired", "serial", "updated_at", "value") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @tool = Tool.new(tool_params)

    respond_to do |format|
      if @tool.save

UPDATE "tools" SET "cost" = ?, "value" = ?, "updated_at" = ? WHERE "tools"."id" = 6  [["cost", #<BigDecimal:7fdf55b77410,'0.6E3',9(18)>], ["value", #<BigDecimal:7fdf55b773c0,'0.6E3',9(18)>], ["updated_at", Mon, 27 May 2013 14:25:52 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @tool.update(tool_params)

DELETE FROM "tools" WHERE "tools"."id" = ?  [["id", 6]]
---
  def destroy
    respond_to do |format|
      if @tool.destroy

SELECT "tools".* FROM "tools" WHERE "tools"."id" = ? LIMIT 1  [["id", "6"]]
---
    def set_tool
      @tool = Tool.find(params[:id])